import os

with open(r"/Users/zandosmirbaj/Desktop/Жандос", 'r') as f:
    l = sum(1 for line in f)
print(l)

#Напишите программу на Python для подсчета количества строк в текстовом файле.